thach.my_api/app/controllers/register_controller.rb

	def create
		@user = User.new(user_params)
		if @user.save
---
INSERT INTO "users" ("email", "password_digest") VALUES (?, ?)  [["email", "tien@gmail.com"], ["password_digest", "$2a$10$GIuyV3KVWdByFIO7WoSieOerfxxwx8sYT78Ws6RCzhX5ZQZ56skmy"]]