thach.my_api/app/controllers/users_controller.rb

UPDATE "users" SET "age" = ?, "level" = ?, "address" = ?, "pass" = ? WHERE "users"."id" = ?  [["age", 2], ["level", "2"], ["address", "2"], ["pass", "2"], ["id", 1]]
---
	def update
    if @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
	def destroy
    if @user.destroy