my_api/app/controllers/post_controller.rb

	def create
		# binding.pry
		@post = Post.new(post_params)
		if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hello"], ["content", "Hello word"], ["created_at", "2017-01-09 04:24:59.635949"], ["updated_at", "2017-01-09 04:24:59.635949"]]

	def update
		# binding.pry
		# @post = Post.find(params[:id])
		if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Hello 1"], ["content", "Hello word"], ["updated_at", "2017-01-09 04:31:43.038482"], ["id", 1]]

	def destroy
		# binding.pry
		# @post = Post.find(params[:id])
		if @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]