my_api/app/controllers/register_controller.rb

	def create
		binding.pry
		@user = User.new(user_params)
		if @user.save
---
INSERT INTO "users" ("email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "tien@gmail.com"], ["password", "123456"], ["created_at", "2017-01-11 04:24:24.553835"], ["updated_at", "2017-01-11 04:24:24.553835"]]